<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
use Spatie\Permission\Models\Role;

class PermissionsRolesSeeder extends Seeder
{
    public function run()
    {


        // قائمة الصلاحيات لكل
        $permissions = [

            'التقارير'
            => [
                'تقرير العملاء',
                'تقرير العروض',
                'تقرير العقود',
                'تقرير الوكالات',
                'تقرير الخصوم',
                'تقرير المشاريع',
                'تقرير الدعاوى',
                'تقرير الجلسات',
                'تقرير الموظفين',
            ],

            'إعدادات النظام'
            => [

                // (1) إعدادات النظام
                'إعدادات النظام',
                'النماذج',

                // (2) إعدادات مركز العمليات
                'اقسام المشاريع والقضايا',
                'حالات العقود',
                'المنتجات',
                'مراحل عروض الأسعار',
                'حالات العميل',
                'قنوات التسويق',
                'القطاعات',
                'المدن',
                'قائمة الدول',
                'مواقع التواصل',
                'قائمة البنوك',

                // (3) إعدادات الموارد البشرية
                'حالات الموارد البشرية',
                'تصنيف الموارد البشرية',
                'تصنيف المخالفات',
                'أنواع المخالفات',
                'أنواع الإجازات',
                'تصنيفات الاصول',
                'مرجعية الاصول',

                // اعدادات التسويق
                'أنواع الحملات والمحتوى',
                'أنماط النشر',
                'أهداف الحملات والمحتوى',
                'أقسام الحملات',
                'الجمهور المستهدف',



                // (4) إعدادات الشؤون القانونية
                'المحكمة',
                'درجة الجهة',
                'التصنيفات الرئيسية',
                'التصنيفات الفرعية',
                'أنواع الدعاوى',
                'أنواع الجلسات',
                'أنواع الاحكام',

                // (5) تصنيف المشتريات
                'تصنيف المشتريات'
            ],

            'إدارة النظام'
            => [
                'الصلاحيات الوظيفية',
                'إضافة دور',
                'حذف دور',
                'تعديل دور',
                'منح الادوار',
                'إضافة / نزع صلاحية للدور',
                'تغيير حالة الموظف',
                'إدارة الإعتمادات',
                'سجل النشاطات',
                'سجل الرسائل',
            ],

            'مركز العمليات'
            => [
                // العملاء
                'كل العملاء',
                'العملاء الخاصين بي',
                'إضافة عميل',
                'حذف عميل',
                'تعديل عميل',
                'إسال SMS للعملاء',

                // العروض
                'كل العروض',
                'العروض الخاصة بي',
                'إضافة عرض',
                'حذف عرض',
                'تعديل عرض',

                // العقود
                'كل العقود',
                'العقود الخاصة بي',
                'إضافة عقد',
                'حذف عقد',
                'تعديل عقد',

                // العقود الإستثنائية
                'كل العقود الإستثنائية',
                'العقود الإستثنائية الخاصة بي',
                'إضافة عقد إستثنائي',
                'حذف عقد إستثنائي',
                'تعديل عقد إستثنائي',
            ],

            'مكتب إدارة المشاريع'
            => [
                'كل المشاريع',
                'المشاريع الخاصة بي',
                'إضافة مشروع',
                'حذف مشروع',
                'تعديل مشروع',
                'مشاهدة مرفق العقد',
                'الإعتماد الفني للمشاريع',
            ],

            'الشؤون القانونية'
            => [
                // الخصوم
                'كل الخصوم',
                'الخصوم الخاصين بي',
                'إضافة خصم',
                'حذف خصم',
                'تعديل خصم',
                'إسال SMS للخصوم',


                // الوكالات
                'كل الوكالات',
                'الوكالات الخاصة بي',
                'إضافة وكالة',
                'حذف وكالة',
                'تعديل وكالة',

                // الدعاوى
                'كل الدعاوى',
                'الدعاوى الخاصة بي',
                'إضافة دعوى',
                'حذف دعوى',
                'تعديل دعوى',

                // الجلسات
                'كل الجلسات',
                'الجلسات الخاصة بي',
                'إضافة جلسة',
                'حذف جلسة',
                'تعديل جلسة',
            ],

            'الموارد البشرية'
            => [
                // الموظفين
                'كل الموظفين',
                'إضافة موظف',
                'حذف موظف',
                'تعديل موظف',
                'إسال SMS للموظفين',
                'إعادة تعين كلمة المرور',

                // الحضور والانصراف
                'الحضور والانصراف',

                // الإجازات
                'طلبات الإجازات',

                // المرتبات
                'إدارة المرتبات',
                'أرصدة الإجازات',

                // العقوبات
                'إدارة الانتهاكات والعقوبات',
                'إضافة عقوبة او إنتهاك',
                'حذف عقوبة او إنتهاك',
                'تعديل عقوبة او إنتهاك',
                'تطبيق/إلغاء عقوبة او إنتهاك',

                // تقيم الأداء
                'تقييم الأداء',

                'إستلام تنبيهات التجديدات',

                // الاصول
                'إدارة الاصول',
                'إضافة اصل',
                'حذف اصل',
                'تعديل اصل',

                // 'اللوائح و السياسات'
                'اللوائح و السياسات',
                'إضافة اللوائح و السياسات',
                'حذف اللوائح و السياسات',
                'تعديل اللوائح و السياسات',

                // 'إدارة السلف'
                'إدارة السلف',
                'إضافة سلفة',
                'حذف سلفة',
                'تعديل سلفة',

                // 'إدارة المكافأت'
                'إدارة المكافأت',
                'إضافة مكافأة',
                'حذف مكافأة',
                'تعديل مكافأة',

                // 'إدارة الخصومات'
                'إدارة الخصومات',
                'إضافة خصم مالي',
                'حذف خصم مالي',
                'تعديل خصم مالي',

                // 'طلبات العهد'
                'طلبات العهد',
                'إضافة عهدة',
                'حذف عهدة',
                'تعديل عهدة',


                // 'طلبات تحديث البيانات'
                'طلبات تحديث البيانات',

                // 'تنبيهات التجديدات'
                'تنبيهات التجديدات'
            ],


            'التسويق'
            => [
                'إدارة المحتوى',
                'إدارة الحملات'
            ],


            'الإدارة المالية'
            => [
                'دفعات العقود',
                'إستلام إشعارات دفعات العقود',
            ],


            'مركز تنظيم الأعمال'
            => [
                'كل المهام',
                'المهام الخاصة بي',
                'مهام مسندة للأخرين',
                'إضافة مهمة',
                'حذف مهمة',
                'تعديل مهمة',
                'ارشيف المهام',

                // طلبات الإعتماد
                'إعتماد العروض',
                'إعتماد العقود',
                'إعتماد المشاريع',
                'إعتماد الإجازات',
                'إعتماد إخلاء الطرف',
                'إعتماد مسيرات الرواتب',

                // المساعد الذكي
                'المساعد الذكي',

                // التقويم
                'التقويم',

            ],

            'التفاعل الجماعي'
            => [
                'الدردشة',
                'البريد الإلكتروني',
                'كل الإجتماعات',
                'الإجتماعات الخاصة بي',
                'إضافة إجتماع',
                'حذف إجتماع',
                'تعديل إجتماع',

                'الدعم الفني',
            ],

            'إدارة الملفات'
            => [
                'إدارة الملفات',
                'ارشيف العملاء',
                'ارشيف العروض',
                'ارشيف العقود',
                'ارشيف الدعاوى',
                'ارشيف الجلسات',
                'ارشيف المشاريع',
                'ارشيف الموظفين',
            ],

            'مركز المشتريات'
            => [
                'طلبات المشتريات',
                'تغيير حالة الطلب',
                'المشتريات',
                'إضافة مشتريات',
                'حذف مشتريات',
                'تعديل مشتريات',
            ],

            'الخدمات الإلكترونية'
            => [
                'طلبات المشتريات الخاصة بي',
                'إضافة طلب مشتريات',
                'حذف طلب المشتريات',
                'تعديل طلب المشتريات',

                'طلبات الإجازات الخاصة بي',
                'إضافة طلب إجازة',
                'حذف طلب الإجازة',
                'تعديل طلب الإجازة',

                'طلبات العهد الخاصة بي',
                'إضافة طلب عهدة',
                'حذف طلب العهدة',
                'تعديل طلب العهدة',

                'الإنتهاكات و العقوبات الخاصة بي'
            ],


            'الخدمات الذاتية'
            => [
                'تعريف بالراتب',
                'تثبيت راتب',
                'إفادة تدريب',
                'إخلاء طرف',
                'إضافة طلب إخلاء طرف',
                'حذف طلب إخلاء طرف',
                'تعديل طلب إخلاء طرف',
            ],

            'إدارة الإستبيانات'
            => [
                'إدارة الإستبيانات',
                'إحصائيات الإستبيان',
                'تعديل إستبيان',
            ],

            'إدارة القاعات'
            => [
                'إدارة القاعات',
                'إضافة حجز',
                'حذف حجز',
                'تعديل حجز',
            ],

        ];

        // إنشاء الصلاحيات وربطها بالأقسام
        foreach ($permissions as $section => $perms) {
            foreach ($perms as $perm) {
                Permission::firstOrCreate([
                    'name' => $perm,
                    'section' => $section,
                ]);
            }
        }

        // إنشاء الأدوار وربط الصلاحيات بها
        // مثال: دور "Admin" يمتلك جميع الصلاحيات
        $roleAdmin = Role::firstOrCreate(['name' => 'Admin']);
        $roleAdmin->syncPermissions(Permission::all());
    }
}
